00test/Laser_3D_refer_5gmin_newmesh2_newlaser/system/blockMeshDict65degree
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;


vertices
(
    // Section 1: 0° (y -> 0, z = y_original) - indices 0-9
    (1  -5.287075  0)                  //0*
    (-50  -29.068375  0)             //1
    (-50  -27.965  0)             //2
    (0  -4.65  0)                 //3*
    (0  -1.2  0)                  //4
    (1  -1.2  0)                  //5
    (1  -50  0)                   //6
    (70.00  -50  0)               //7
    (70.00  -10  0)               //8
    (70.00  -1.2  0)              //9

    (0  0  0)                     //10 center9
    (1  0  0)                     //11 center10
    (70.00  0  0)                 //12 center15

    // Section 2: 45° rotation around x-axis - indices 13-22
    (1  -3.738526  -3.738526)     //13 (from 0)
    (-50  -20.554445  -20.554445) //14 (from 1)
    (-50  -19.774241  -19.774241) //15 (from 2)
    (0  -3.288047  -3.288047)     //16 (from 3)
    (0  -1.2  -1.2)               //17 (from 4)
    (1  -1.2  -1.2)               //18 (from 5)
    (1  -35.355339  -35.355339)   //19 (from 6)
    (70.00  -35.355339  -35.355339) //20 (from 7)
    (70.00  -7.071068  -7.071068) //21 (from 8)
    (70.00  -1.2  -1.2)           //22 (from 9)
    
    // Section 3: 90° rotation around x-axis - indices 23-32
    (1  0  -5.287075)                  //23 (from 0)
    (-50  0  -29.068375)             //24 (from 1)
    (-50  0  -27.965)             //25 (from 2)
    (0  0  -4.65)                 //26 (from 3)
    (0  0  -1.2)                  //27 (from 4)
    (1  0  -1.2)                  //28 (from 5)
    (1  0  -50)                   //29 (from 6)
    (70.00  0  -50)               //30 (from 7)
    (70.00  0  -10)               //31 (from 8)
    (70.00  0  -1.2)              //32 (from 9)
    
    // Symmetric Section 1: 0° mirrored across XOZ plane (y negated) - indices 33-42
    (1  5.287075  0)                   //33
    (-50  29.068375  0)              //34
    (-50  27.965  0)              //35
    (0  4.65  0)                  //36
    (0  1.2  0)                   //37
    (1  1.2  0)                   //38
    (1  50  0)                    //39
    (70.00  50  0)                //40
    (70.00  10  0)                //41
    (70.00  1.2  0)               //42
    
    // Symmetric Section 2: 45° mirrored across XOZ plane - indices 43-52
    (1  3.738526  -3.738526)      //43
    (-50  20.554445  -20.554445)  //44
    (-50  19.774241  -19.774241)  //45
    (0  3.288047  -3.288047)      //46
    (0  1.2  -1.2)                //47
    (1  1.2  -1.2)                //48
    (1  35.355339  -35.355339)    //49
    (70.00  35.355339  -35.355339)//50
    (70.00  7.071068  -7.071068)  //51
    (70.00  1.2  -1.2)            //52
    
    // XOY Symmetry: z-coordinates negated - only z!=0 vertices
    // Section 2 mirrored (z-negation of 13-22): indices 53-62
    (1  -3.738526  3.738526)      //53
    (-50  -20.554445  20.554445)  //54
    (-50  -19.774241  19.774241)  //55
    (0  -3.288047  3.288047)      //56
    (0  -1.2  1.2)                //57
    (1  -1.2  1.2)                //58
    (1  -35.355339  35.355339)    //59
    (70.00  -35.355339  35.355339)//60
    (70.00  -7.071068  7.071068)  //61
    (70.00  -1.2  1.2)            //62
    
    // Section 3 mirrored (z-negation of 23-32): indices 63-72
    (1  0  5.287075)                   //63
    (-50  0  29.068375)              //64
    (-50  0  27.965)              //65
    (0  0  4.65)                  //66
    (0  0  1.2)                   //67
    (1  0  1.2)                   //68
    (1  0  50)                    //69
    (70.00  0  50)                //70
    (70.00  0  10)                //71
    (70.00  0  1.2)               //72
    
    // Symmetric Section 2 mirrored (z-negation of 43-52): indices 73-82
    (1  3.738526  3.738526)       //73
    (-50  20.554445  20.554445)   //74
    (-50  19.774241  19.774241)   //75
    (0  3.288047  3.288047)       //76
    (0  1.2  1.2)                 //77
    (1  1.2  1.2)                 //78
    (1  35.355339  35.355339)     //79
    (70.00  35.355339  35.355339) //80
    (70.00  7.071068  7.071068)   //81
    (70.00  1.2  1.2)             //82

    // Extension section at x = -55
    (-55.0  -31.399875  0)           //83
    (-55.0  -27.965  0)           //84

    // Section 2: 45° rotation around x-axis (from 83-84)
    (-55.0  -22.203064  -22.203064) //85
    (-55.0  -19.774241  -19.774241) //86

    // Section 3: 90° rotation around x-axis (from 83-84)
    (-55.0  0  -31.399875)             //87
    (-55.0  0  -27.965)             //88

    // Symmetric Section 1: y negated (from 83-84)
    (-55.0  31.399875  0)              //89
    (-55.0  27.965  0)              //90

    // Symmetric Section 2: 45° mirrored across XOZ (from 83-84)
    (-55.0  22.203064  -22.203064) //91
    (-55.0  19.774241  -19.774241) //92

    // Section 2 z-mirrored (z-sym of 85-86)
    (-55.0  -22.203064  22.203064) //93
    (-55.0  -19.774241  19.774241) //94

    // Section 3 z-mirrored (z-sym of 87-88)
    (-55.0  0  31.399875)              //95
    (-55.0  0  27.965)              //96

    // Symmetric Section 2 z-mirrored (z-sym of 91-92)
    (-55.0  22.203064  22.203064) //97
    (-55.0  19.774241  19.774241) //98
);

edges
(
    // Arc edges from Section 1 (0°) to Section 2 (45°) around X axis
    
    // x = 1
    arc 0 13 (1 -4.884620 -2.023276)
    arc 6 19 (1 -46.194 -19.134)

    // x = 0
    arc 3 16 (0 -4.296040 -1.779478)

    // x = 70.00
    arc 8 21 (70.00 -9.239 -3.827)
    arc 7 20 (70.00 -46.194 -19.134)

    // x = -50
    arc 1 14 (-50 -26.855676 -11.123985)
    arc 2 15 (-50 -25.836291 -10.701742)

    // Arc edges from Section 2 (45°) to Section 3 (90°) around X axis
    
    // x = 1
    arc 13 23 (1 -2.023276 -4.884620)
    arc 19 29 (1 -19.134 -46.194)

    // x = 0
    arc 16 26 (0 -1.779478 -4.296040)

    // x = 70.00
    arc 21 31 (70.00 -3.827 -9.239)
    arc 20 30 (70.00 -19.134 -46.194)

    // x = -50
    arc 14 24 (-50 -11.123985 -26.855676)
    arc 15 25 (-50 -10.701742 -25.836291)

    // Symmetric arc edges from Section 1 (0°) to Section 2 (45°)
    
    // x = 1
    arc 33 43 (1 4.884620 -2.023276)
    arc 39 49 (1 46.194 -19.134)

    // x = 0
    arc 36 46 (0 4.296040 -1.779478)

    // x = 70.00
    arc 41 51 (70.00 9.239 -3.827)
    arc 40 50 (70.00 46.194 -19.134)

    // x = -50
    arc 34 44 (-50 26.855676 -11.123985)
    arc 35 45 (-50 25.836291 -10.701742)

    // Symmetric arc edges from Section 2 (45°) to Section 3 (90°)
    
    // x = 1
    arc 43 23 (1 2.023276 -4.884620)
    arc 49 29 (1 19.134 -46.194)

    // x = 0
    arc 46 26 (0 1.779478 -4.296040)

    // x = 70.00
    arc 51 31 (70.00 3.827 -9.239)
    arc 50 30 (70.00 19.134 -46.194)

    // x = -50
    arc 44 24 (-50 11.123985 -26.855676)
    arc 45 25 (-50 10.701742 -25.836291)

    // XOY Symmetric arc edges: z-coordinates negated
    
    // x = 1
    arc 0 53 (1 -4.884620 2.023276)
    arc 6 59 (1 -46.194 19.134)

    // x = 0
    arc 3 56 (0 -4.296040 1.779478)

    // x = 70.00
    arc 8 61 (70.00 -9.239 3.827)
    arc 7 60 (70.00 -46.194 19.134)

    // x = -50
    arc 1 54 (-50 -26.855676 11.123985)
    arc 2 55 (-50 -25.836291 10.701742)

    // Section 2_z-sym to Section 3_z-sym
    
    // x = 1
    arc 53 63 (1 -2.023276 4.884620)
    arc 59 69 (1 -19.134 46.194)

    // x = 0
    arc 56 66 (0 -1.779478 4.296040)

    // x = 70.00
    arc 61 71 (70.00 -3.827 9.239)
    arc 60 70 (70.00 -19.134 46.194)

    // x = -50
    arc 54 64 (-50 -11.123985 26.855676)
    arc 55 65 (-50 -10.701742 25.836291)
    
    // Symmetric Section 1 (z=0) to Symmetric Section 2_z-sym
    
    // x = 1
    arc 33 73 (1 4.884620 2.023276)
    arc 39 79 (1 46.194 19.134)

    // x = 0
    arc 36 76 (0 4.296040 1.779478)

    // x = 70.00
    arc 41 81 (70.00 9.239 3.827)
    arc 40 80 (70.00 46.194 19.134)

    // x = -50
    arc 34 74 (-50 26.855676 11.123985)
    arc 35 75 (-50 25.836291 10.701742)
    
    // Symmetric Section 2_z-sym to Section 3_z-sym
    
    // x = 1
    arc 73 63 (1 2.023276 4.884620)
    arc 79 69 (1 19.134 46.194)

    // x = 0
    arc 76 66 (0 1.779478 4.296040)

    // x = 70.00
    arc 81 71 (70.00 3.827 9.239)
    arc 80 70 (70.00 19.134 46.194)

    // x = -50
    arc 74 64 (-50 11.123985 26.855676)
    arc 75 65 (-50 10.701742 25.836291)

    // === Arc edges for vertices 83-98 (x = -55.0) ===

    // Sec1 (0°) -> Sec2 (45°), midpoint at 22.5°
    arc 83 85 (-55.0 -29.009702 -12.016212)
    arc 84 86 (-55.0 -25.836291 -10.701742)

    // Sec2 (45°) -> Sec3 (90°), midpoint at 67.5°
    arc 85 87 (-55.0 -12.016212 -29.009702)
    arc 86 88 (-55.0 -10.701742 -25.836291)

    // SymSec1 (0° mirrored) -> SymSec2 (45° mirrored), midpoint at 22.5°
    arc 89 91 (-55.0 29.009702 -12.016212)
    arc 90 92 (-55.0 25.836291 -10.701742)

    // SymSec2 (45° mirrored) -> Sec3 (90°), midpoint at 67.5°
    arc 91 87 (-55.0 12.016212 -29.009702)
    arc 92 88 (-55.0 10.701742 -25.836291)

    // Sec1 (0°) -> Sec2_zsym (45° z-mirrored), midpoint at 22.5°
    arc 83 93 (-55.0 -29.009702 12.016212)
    arc 84 94 (-55.0 -25.836291 10.701742)

    // Sec2_zsym (45° z-mirrored) -> Sec3_zsym (90° z-mirrored), midpoint at 67.5°
    arc 93 95 (-55.0 -12.016212 29.009702)
    arc 94 96 (-55.0 -10.701742 25.836291)

    // SymSec1 -> SymSec2_zsym, midpoint at 22.5°
    arc 89 97 (-55.0 29.009702 12.016212)
    arc 90 98 (-55.0 25.836291 10.701742)

    // SymSec2_zsym -> Sec3_zsym, midpoint at 67.5°
    arc 97 95 (-55.0 12.016212 29.009702)
    arc 98 96 (-55.0 10.701742 25.836291)
);

blocks
(
    hex (10 4 17 27 11 5 18 28) (10 10 6) simpleGrading (1 1 1)
    hex (11 5 18 28 12 9 22 32) (10 10 70) simpleGrading (1 1 1)
    hex (3 0 1 2 16 13 14 15) (6 40 10) simpleGrading (1 1 1)
    hex (3 4 5 0 16 17 18 13) (10 6 10) simpleGrading (1 1 1)
    hex (6 0 8 7 19 13 21 20) (20 70 10) simpleGrading (0.3 1 1)
    hex (0 5 9 8 13 18 22 21) (10 70 10) simpleGrading (1 1 1)

    hex (16 13 14 15 26 23 24 25) (6 40 10) simpleGrading (1 1 1)
    hex (16 17 18 13 26 27 28 23) (10 6 10) simpleGrading (1 1 1)
    hex (19 13 21 20 29 23 31 30) (20 70 10) simpleGrading (0.3 1 1)
    hex (13 18 22 21 23 28 32 31) (10 70 10) simpleGrading (1 1 1)

    hex (27 47 37 10 28 48 38 11) (10 10 6) simpleGrading (1 1 1)
    hex (28 48 38 11 32 52 42 12) (10 10 70) simpleGrading (1 1 1)
    hex (35 34 33 36 45 44 43 46) (6 40 10) simpleGrading (1 1 1)
    hex (33 38 37 36 43 48 47 46) (10 6 10) simpleGrading (1 1 1)
    hex (40 41 33 39 50 51 43 49) (20 70 10) simpleGrading (0.3 1 1)
    hex (41 42 38 33 51 52 48 43) (10 70 10) simpleGrading (1 1 1)
    hex (45 44 43 46 25 24 23 26) (6 40 10) simpleGrading (1 1 1)
    hex (43 48 47 46 23 28 27 26) (10 6 10) simpleGrading (1 1 1)
    hex (50 51 43 49 30 31 23 29) (20 70 10) simpleGrading (0.3 1 1)
    hex (51 52 48 43 31 32 28 23) (10 70 10) simpleGrading (1 1 1)

    hex (67 57 4 10 68 58 5 11) (10 10 6) simpleGrading (1 1 1)
    hex (68 58 5 11 72 62 9 12) (10 10 70) simpleGrading (1 1 1)
    hex (2 1 0 3 55 54 53 56) (6 40 10) simpleGrading (1 1 1)
    hex (0 5 4 3 53 58 57 56) (10 6 10) simpleGrading (1 1 1)
    hex (7 8 0 6 60 61 53 59) (20 70 10) simpleGrading (0.3 1 1)
    hex (8 9 5 0 61 62 58 53) (10 70 10) simpleGrading (1 1 1)
    hex (55 54 53 56 65 64 63 66) (6 40 10) simpleGrading (1 1 1)
    hex (53 58 57 56 63 68 67 66) (10 6 10) simpleGrading (1 1 1)
    hex (60 61 53 59 70 71 63 69) (20 70 10) simpleGrading (0.3 1 1)
    hex (61 62 58 53 71 72 68 63) (10 70 10) simpleGrading (1 1 1)
    hex (10 37 77 67 11 38 78 68) (10 10 6) simpleGrading (1 1 1)
    hex (11 38 78 68 12 42 82 72) (10 10 70) simpleGrading (1 1 1)
    hex (36 33 34 35 76 73 74 75) (6 40 10) simpleGrading (1 1 1)
    hex (36 37 38 33 76 77 78 73) (10 6 10) simpleGrading (1 1 1)
    hex (39 33 41 40 79 73 81 80) (20 70 10) simpleGrading (0.3 1 1)
    hex (33 38 42 41 73 78 82 81) (10 70 10) simpleGrading (1 1 1)
    hex (76 73 74 75 66 63 64 65) (6 40 10) simpleGrading (1 1 1)
    hex (76 77 78 73 66 67 68 63) (10 6 10) simpleGrading (1 1 1)
    hex (79 73 81 80 69 63 71 70) (20 70 10) simpleGrading (0.3 1 1)
    hex (73 78 82 81 63 68 72 71) (10 70 10) simpleGrading (1 1 1)

    // Extension x=-55 to x=-50
    hex (83 84 2 1 85 86 15 14) (6 5 10) simpleGrading (1 1 1)
    hex (34 35 90 89 44 45 92 91) (6 5 10) simpleGrading (1 1 1)
    hex (1 2 84 83 54 55 94 93) (6 5 10) simpleGrading (1 1 1)
    hex (89 90 35 34 97 98 75 74) (6 5 10) simpleGrading (1 1 1)

    hex (85 86 15 14 87 88 25 24) (6 5 10) simpleGrading (1 1 1)
    hex (44 45 92 91 24 25 88 87) (6 5 10) simpleGrading (1 1 1)
    hex (54 55 94 93 64 65 96 95) (6 5 10) simpleGrading (1 1 1)
    hex (97 98 75 74 95 96 65 64) (6 5 10) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 2 15 16)
            (0 1 14 13)
            (16 15 25 26)
            (13 14 24 23)

            (36 35 45 46)
            (33 34 44 43)
            (46 45 25 26)
            (43 44 24 23)

            (3 2 55 56)
            (0 1 54 53)
            (56 55 65 66)
            (53 54 64 63)

            (36 35 75 76)
            (33 34 74 73)
            (76 75 65 66)
            (73 74 64 63)

            (83 1 14 85)
            (85 14 24 87)
            (34 89 91 44)
            (44 91 87 24)
            (1 83 93 54)
            (54 93 95 64)
            (89 34 74 97)
            (97 74 64 95)

            (84 2 15 86)
            (86 15 25 88)
            (35 90 92 45)
            (45 92 88 25)
            (2 84 94 55)
            (55 94 96 65)
            (90 35 75 98)
            (98 75 65 96)
        );
    }

    powderInlet
    {
        type patch;
        faces
        (
            (83 84 86 85)
            (89 90 92 91)
            (83 84 94 93)
            (89 90 98 97)

            (85 86 88 87)
            (91 92 88 87)
            (93 94 96 95)
            (97 98 96 95)
        );
    }

    gasInlet
    {
        type patch;
        faces
        (
            (3 4 17 16)
            (16 17 27 26)

            (36 37 47 46)
            (46 47 27 26)

            (3 4 57 56)
            (56 57 67 66)

            (36 37 77 76)
            (76 77 67 66)

            (10 4 17 27)
            (10 37 47 27)
            (10 37 77 67)
            (10 4 57 67)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (12 9 22 32)
            (12 42 52 32)

            (0 6 19 13)
            (6 7 20 19)
            (7 8 21 20)
            (8 9 22 21)

            (13 19 29 23)
            (19 20 30 29)
            (20 21 31 30)
            (21 22 32 31)

            (33 39 49 43)
            (39 40 50 49)
            (40 41 51 50)
            (41 42 52 51)

            (43 49 29 23)
            (49 50 30 29)
            (50 51 31 30)
            (51 52 32 31)

            (12 9 62 72)
            (12 42 82 72)

            (0 6 59 53)
            (6 7 60 59)
            (7 8 61 60)
            (8 9 62 61)

            (53 59 69 63)
            (59 60 70 69)
            (60 61 71 70)
            (61 62 72 71)

            (33 39 79 73)
            (39 40 80 79)
            (40 41 81 80)
            (41 42 82 81)

            (73 79 69 63)
            (79 80 70 69)
            (80 81 71 70)
            (81 82 72 71)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
